djyos/djyos/djysrc/exp-component/firmware/lpc12xx/src/lpc12xx_uart.c
    uint32_t relativeError = 0;
    uint32_t relativeOptimalError = (baudrate >> UART_ACCEPTED_BAUDRATE_ERROR);

    /* get UART block clock */
    if (UARTx == LPC_UART0){
        uClk = (cn_mclk/LPC_SYSCON->UART0CLKDIV)>>4; /* div by 16 */
    }
    else if (UARTx == LPC_UART1){
        uClk = (cn_mclk/LPC_SYSCON->UART1CLKDIV)>>4; /* div by 16 */
    }

    /* In the Uart IP block, baud rate is calculated using FDR and DLL-DLM registers
         * The formula is :
         * BaudRate= uClk * (mulFracDiv/(mulFracDiv+dividerAddFracDiv) / (16 * (DLL)
         * It involves floating point calculations. That's the reason the formulae are adjusted with
         * Multiply and divide method.*/
    /* The value of mulFracDiv and dividerAddFracDiv should comply to the following expressions:
         * 0 < mulFracDiv <= 15, 0 <= dividerAddFracDiv <= 15 */
    for (dividerAddFracDiv = 0 ; dividerAddFracDiv < 15 ;dividerAddFracDiv++){       
        for (mulFracDiv = (dividerAddFracDiv + 1) ; mulFracDiv <= 15 ;mulFracDiv++){
            temp = (mulFracDiv * uClk) / ((mulFracDiv + dividerAddFracDiv));
            
            diviser = temp / baudrate;
            if ((temp % baudrate) > (baudrate >> 1))
            diviser++;
            
            if (diviser > 2 && diviser < 65536){
                calcBaudrate = temp / diviser;
                
                if (calcBaudrate <= baudrate)
                  relativeError = baudrate - calcBaudrate;
                else
                  relativeError = calcBaudrate - baudrate;
                
                if ((relativeError < relativeOptimalError)){
                    mulFracDivOptimal = mulFracDiv ;
                    dividerAddOptimal = dividerAddFracDiv;
                    diviserOptimal = diviser;
                    relativeOptimalError = relativeError;
                    errorStatus = SUCCESS;
                }
            } /* End of if */
        } /* end of inner for loop */
    } /* end of outer for loop  */

    if (errorStatus == SUCCESS){
        UARTx->LCR |= UART_LCR_DLAB_EN;
        /* Then reset DLAB bit */
        while(UARTx->LCR & UART_LCR_DLAB_EN){        
           UARTx->DLL = UART_LOAD_DLL(diviserOptimal);
           UARTx->DLM = UART_LOAD_DLM(diviserOptimal);
           UARTx->LCR &= (~UART_LCR_DLAB_EN) & UART_LCR_BITMASK;
           UARTx->FDR = (UART_FDR_MULVAL(mulFracDivOptimal) |\
                         UART_FDR_DIVADDVAL(dividerAddOptimal)) & UART_FDR_BITMASK;
        }
    }

    return errorStatus;
}

/*
  * @brief       Initializes the UARTx peripheral.
  * @param    UARTx   UART peripheral selected, should be LPC_UART0, LPC_UART1.
  * @return     None
  */
void UART_Init(LPC_UART_TypeDef *UARTx)
{
    volatile uint32_t tmp;
    CHECK_PARAM(PARAM_UARTx(UARTx));

    UARTx->FDR = 0x10;           //set to default value: 0x10

    /* Empty the registers */
    UARTx->FCR = ( UART_FCR_FIFO_EN | UART_FCR_RX_RS | UART_FCR_TX_RS);

    while (UARTx->LSR & UART_LS_RX_DATA_READY){
        tmp = UARTx->RBR;        // Dummy reading
    }

    UARTx->TER = UART_TER_TXEN;
    while (!(UARTx->LSR & UART_LS_TX_EMPTY));  // Wait for current transmit complete

    UARTx->TER = 0;             // Disable Tx
    UARTx->IER = 0;             // Disable interrupt
    UARTx->LCR = 0;             // Set LCR to default state
    UARTx->ACR = 0;             // Set ACR to default state
    
    if (UARTx == LPC_UART0){   
#ifdef _MODEM        
        UARTx->MCR = 0;         // Set Modem Control to default state
        tmp = UARTx->MSR;       // Dummy Reading to Clear Status
#endif        
#ifdef _RS485        
        UARTx->RS485CTRL = 0;   // Set RS485 control to default state
        UARTx->ADRMATCH = 0;    // Set RS485 addr match to default state
        UARTx->RS485DLY = 0;    // Set RS485 delay timer to default state
#endif        
    }
#ifdef _IRDA
    else{
    
        UARTx->ICR = 0;         // Set IrDA to default state
    }
#endif
    tmp = UARTx->LSR;           // Dummy reading

    tmp = uart_get_num(UARTx);

    UART_Configration[tmp].baudrate = 0;
    UART_Configration[tmp].databits = UART_CFG_DATABIT_8;
    UART_Configration[tmp].stopbits = UART_CFG_STOPBIT_1;
    UART_Configration[tmp].parity = UART_CFG_PARITY_NONE;
    UART_Configration[tmp].fifolevel = UART_CFG_FIFOTRG_1;
    UART_Configration[tmp].fifodma = UART_CFG_DMAMODE_DISABLE;
    UART_Configration[tmp].txdbreak = UART_CFG_TXDBREAK_DISABLE;

}

/*
  * @brief   Config the UARTx according to the specified parameters in the UART_CFG_Type.
  * @param UARTx   UART peripheral selected, should be LPC_UART0, LPC_UART1.
  * @param config    UART_ConfigStruct Pointer to a UART_CFG_Type structure
  *                          that contains the configuration information for the specified UART periphera.
  * @return  None
  */
void UART_SetConfig(LPC_UART_TypeDef *UARTx, UART_CFG_Type *config)
{
    uint8_t tmp;

    CHECK_PARAM(PARAM_UARTx(UARTx));
    CHECK_PARAM(PARAM_UART_DATABIT(config->databits));
    CHECK_PARAM(PARAM_UART_PARITY(config->parity));
    CHECK_PARAM(PARAM_UART_STOPBIT(config->stopbits));
    CHECK_PARAM(PARAM_UART_FIFO_LEVEL(config->fifolevel));
    CHECK_PARAM(PARAM_UART_FIFO_DMA(config->fifodma));

    tmp = uart_get_num(UARTx);
    
    if(UART_Configration[tmp].baudrate != (*config).baudrate){
        
        uart_set_divisors(UARTx, (config->baudrate));        
        UART_Configration[tmp].baudrate = (*config).baudrate;       
    }

    UARTx->LCR = (((config->databits)|(config->parity)|(config->stopbits)|\
                 (config->txdbreak)) & UART_LCR_BITMASK);
   
    UARTx->FCR = ((UART_FCR_FIFO_EN | (config->fifodma)|(config->fifolevel))&\
                   UART_FCR_BITMASK);

    UART_Configration[tmp].databits = (*config).databits;
    UART_Configration[tmp].stopbits = (*config).stopbits;
    UART_Configration[tmp].parity = (*config).parity;
    UART_Configration[tmp].txdbreak = (*config).txdbreak;
    UART_Configration[tmp].fifolevel = (*config).fifolevel;
    UART_Configration[tmp].fifodma = (*config).fifodma;

   
