djyos/djyos/djysrc/exp-component/firmware/lpc12xx/src/lpc12xx_uart.c
}

/*
  * @brief     Get configuration the UARTx according to the specified parameters in the UART_CFG_Type.
  * @param   UARTx   UART peripheral selected, should be LPC_UART0, LPC_UART1.
  * @param   config    UART_ConfigStruct Pointer to a UART_CFG_Type structure
  *                             that contains the configuration information for the specified UART periphera.
  * @return    None
  */

void UART_GetConfig(LPC_UART_TypeDef *UARTx, UART_CFG_Type *config)
{
    uint32_t tmp;

    CHECK_PARAM(PARAM_UARTx(UARTx));
    tmp = uart_get_num(UARTx);
    *config = UART_Configration[tmp];
}

/**
  * @brief    Enable/Disable transmission on UART TxD pin
  * @param UARTx   UART peripheral selected, should be LPC_UART0, LPC_UART1
  * @param NewState New State of Tx transmission function, should be:
  *                            - ENABLE: Enable this function
  *                            - DISABLE: Disable this function 
  * @return none
  */
void UART_ConfigTXD(LPC_UART_TypeDef *UARTx, FunctionalState NewState)
{
    CHECK_PARAM(PARAM_UARTx(UARTx));
    if (NewState == ENABLE) {   
        UARTx->TER |= UART_TER_TXEN;
    }else{
        UARTx->TER &= (~UART_TER_TXEN) & UART_TER_BITMASK;
    }
}

/*
  * @brief    Send a block of data via UART peripheral
  * @param UARTx   Selected UART used to send data, should be LPC_UART0, LPC_UART1.
  * @param txbuf   Pointer to Transmit buffer
  * @param buflen  Length of Transmit buffer, a multiple of 16 is better.
  *                        16 is the best because the FIFO number is 16.
  * @param timeout     UART_process_time_delay definition 
  * @return  Number of bytes sent.
  */
uint32_t UART_Send(LPC_UART_TypeDef *UARTx, uint8_t *txbuf, uint32_t buflen,\
                       uint32_t timeout)
{
    uint32_t bToSend, bSent, timeOut, fifo_cnt;
    uint8_t *pChar = txbuf;

    CHECK_PARAM(PARAM_UARTx(UARTx));
    CHECK_PARAM(PARAM_UART_PROCESS_DELAY(timeout));

    bToSend = buflen;

    bSent = 0;
    while (bToSend){
        timeOut = timeout;
        // Wait for THR empty with timeout
        while (!(UARTx->LSR & UART_LS_TX_EMPTY)) {
            if (timeOut == 0) break;
            timeOut--;
        }
        if(timeOut == 0) break;     // Time out!
        fifo_cnt = UART_TX_FIFO_SIZE;
        while (fifo_cnt && bToSend){
            UARTx->THR = ((*pChar++) & UART_THR_MASKBIT);
            fifo_cnt--;
            bToSend--;
            bSent++;
        }
    }
    return bSent;
}

/*
  * @brief    Receive a block of data via UART peripheral
  * @param UARTx    Selected UART used to send data, should be LPC_UART0, LPC_UART1
  * @param rxbuf      Pointer to Received buffer 
  * @param buflen     Length of Received buffer, a multiple of 16 is better.
  *                           16 is the best because the FIFO number is 16.
  * @param timeout   UART_process_time_delay definition
  * @return  Number of bytes received
  */
uint32_t UART_Receive(LPC_UART_TypeDef *UARTx, uint8_t *rxbuf, uint32_t buflen,\
                           uint32_t timeout)
{
    uint32_t bToRecv, bRecv, timeOut;
    uint8_t *pChar = rxbuf;

    CHECK_PARAM(PARAM_UARTx(UARTx));
    CHECK_PARAM(PARAM_UART_PROCESS_DELAY(timeout));

    bToRecv = buflen;

    bRecv = 0;
    while (bToRecv){
        timeOut = timeout;
        while (!(UARTx->LSR & UART_LS_RX_DATA_READY)){
            if (timeOut == 0) break;
            timeOut--;
        }
        // Time out!
        if(timeOut == 0) break;
        // Get data from the buffer
        (*pChar++) = (UARTx->RBR & UART_RBR_MASKBIT);
        bToRecv--;
        bRecv++;
    }
    return bRecv;
}

/*
  * @brief     Get current value of Line Status register in UART peripheral.
  * @param  UARTx   UART peripheral selected, should be LPC_UART0, LPC_UART1
  * @return   Current value of Line Status register in UART peripheral.
  *               The return value of this function must be ANDed with each member in
  *                UART_line_status_type definitions to determine current flag status
  *                corresponding to each Line status type. Because some flags in
  *                Line Status register will be cleared after reading, the next reading
  *                Line Status register could not be correct. So this function used to
  *                read Line status register in one time only, then the return value
  *                used to check all flags.
  */
uint8_t UART_GetLineStatus(LPC_UART_TypeDef* UARTx)
{
    CHECK_PARAM(PARAM_UARTx(UARTx));

    return ((UARTx->LSR) & UART_LSR_BITMASK);
}

#ifdef _UART_INT
/*
 * @brief   Enable or Disable specified UART interrupt.
 * @param UARTx          UART peripheral selected, should be LPC_UART0, LPC_UART1
 * @param UARTIntCfg  refer to UART_interrupt_type definitions
 * @param NewState      New state of specified UART interrupt type, should be:
 *                                 - ENALBE: Enable this UART interrupt type.
 *                                 - DISALBE: Disable this UART interrupt type.
 * @return      None
 */
void UART_ConfigInts(LPC_UART_TypeDef *UARTx, uint16_t UARTIntCfg,\
                         FunctionalState NewState)
{
    CHECK_PARAM(PARAM_UARTx(UARTx));
    CHECK_PARAM(PARAM_UART_INTCFG(UARTIntCfg));
    CHECK_PARAM(PARAM_FUNCTIONALSTATE(NewState));
    if (NewState == ENABLE){
        UARTx->IER |= UARTIntCfg;
    }else{
        uint32_t bitmask = UART_IER_BITMASK;
        if(uart_get_num(UARTx) == 0){
            bitmask = UART_IER_BITMASK2;
        }
        UARTx->IER &= (~UARTIntCfg) & bitmask;
    }
}

/*
  * @brief    Get current value of Interrupt identification register in UART peripheral.
  * @param  UARTx   UART peripheral selected, should be LPC_UART0, LPC_UART1
  * @return  Current value of interrupt Status register in UART peripheral.
  *              The return value of this function must be ANDed with each member in
  *              UART_int_status_type definitions to determine current flag status
  *              corresponding to each Line status type. Because some flags in
  *              Interrupt Identification register will be cleared after reading, the next reading
  *              Interrupt Identification register could not be correct. So this function used to
  *              read Interrupt Identification register in one time only, then the return value
  *              used to check all flags.
  */
uint16_t UART_GetINTStatus(LPC_UART_TypeDef* UARTx)
{
    CHECK_PARAM(PARAM_UARTx(UARTx));

    return ((UARTx->IIR) & UART_IIR_BITMASK);
}

