djyos/djyos/djysrc/exp-component/firmware/lpc12xx/src/lpc12xx_uart.c
/*
  * @brief     Start Auto Baudrate activity
  * @param  UARTx   UART peripheral selected, should be LPC_UART0, LPC_UART1
  * @param  mode    UART_auto_baudrate_mode_type
  * @param  restart   UART_auto_baudrate_restart_type definitions
  * @return   none
  */
void UART_StartAutoBaud(LPC_UART_TypeDef *UARTx, uint8_t mode, uint8_t restart)
{
    CHECK_PARAM(PARAM_UARTx(UARTx));
    CHECK_PARAM(PARAM_UART_AB_MODE(mode));
    CHECK_PARAM(PARAM_UART_AB_RESTART(restart));       
    
    // Clear DLL and DLM value
    UARTx->LCR |= UART_LCR_DLAB_EN;
    UARTx->DLL = 0;
    UARTx->DLM = 0;
    UARTx->LCR &= ~UART_LCR_DLAB_EN;
    // FDR value must be reset to default value
    UARTx->FDR = 0x10;
    UARTx->ACR = (UART_ACR_START | (mode) | (restart));

}

/*
  * @brief     Clear Auto Baudrate int flag
  * @param  UARTx   UART peripheral selected, should be LPC_UART0, LPC_UART1
  *               Auto-baudrate mode enable bit will be cleared once this mode completed.
  * @return   none
  */

void UART_ClearAutoBaud(LPC_UART_TypeDef *UARTx)
{
    CHECK_PARAM(PARAM_UARTx(UARTx));

    UARTx->ACR = (UART_ACR_ABEOINT_CLR | UART_ACR_ABTOINT_CLR);
}

#endif //_UART_INT

#ifdef _MODEM
/*
  * @brief    Configure Full Modem mode for UART peripheral
  * @param UARTx  Only should be LPC_UART0 
  * @param config   A pointer to UART_MODEM_CFG_Type structure that
  *                         contains specified information about UART auto baudrate configuration
  * @return none
  */
void UART_SetConfigModem(LPC_UART_TypeDef *UARTx, UART_MODEM_CFG_Type *config)
{
    uint8_t tmp;

    CHECK_PARAM(PARAM_UART_MODEM(UARTx));
    CHECK_PARAM(PARAM_MODEM_PIN_DTR(config->DTRcontrol));
    CHECK_PARAM(PARAM_MODEM_PIN_RTS(config->RTScontrol));
    CHECK_PARAM(PARAM_MODEM_MODE_LOOPBACK(config->loopback));
    CHECK_PARAM(PARAM_MODEM_MODE_AUTO_RTS(config->RTSen));
    CHECK_PARAM(PARAM_MODEM_MODE_AUTO_CTS(config->CTSen));

    tmp = config->DTRcontrol;
    tmp |= config->RTScontrol;
    tmp |= config->loopback;
    tmp |= config->RTSen;
    tmp |= config->CTSen;   
    UARTx->MCR = (uint8_t)(tmp & UART_MCR_BITMASK);

    UART_ModemConfigration.DTRcontrol = (*config).DTRcontrol;
    UART_ModemConfigration.RTScontrol = (*config).RTScontrol;
    UART_ModemConfigration.loopback = (*config).loopback;
    UART_ModemConfigration.RTSen = (*config).RTSen;
    UART_ModemConfigration.CTSen = (*config).CTSen;

}

/*
  * @brief     Get configure Full Modem mode for UART peripheral
  * @param  UARTx   Only should be LPC_UART0
  * @param  config    A pointer to UART_MODEM_CFG_Type structure that
  *                           contains specified information about UART auto baudrate configuration
  * @return none
  */

void UART_GetConfigModem(LPC_UART_TypeDef *UARTx, UART_MODEM_CFG_Type *config)
{
    CHECK_PARAM(PARAM_UART_MODEM(UARTx));
    *config = UART_ModemConfigration;
}

/*
  * @brief    Get current status of modem status register
  * @param UARTx  Only should be LPC_UART0
  * @return  Current value of modem status register
  *               The return value of this function must be ANDed with each member
  *               UART_modem_status_type definitions to determine current flag status
  *               corresponding to each modem flag status. Because some flags in
  *               modem status register will be cleared after reading, the next reading
  *               modem register could not be correct. So this function used to
  *               read modem status register in one time only, then the return value
  *               used to check all flags.
  */
uint8_t UART_GetModemStatus(LPC_UART_TypeDef *UARTx)
{
    CHECK_PARAM(PARAM_UART_MODEM(UARTx));
    return ((UARTx->MSR) & UART_MSR_BITMASK);
}
#endif
#ifdef _RS485
/*
  * @brief   Configure UART in RS485 mode according to the specified parameters
  * @param UARTx  Only should be LPC_UART0
  * @param config   RS485ConfigStruct Pointer to a UART_RS485_CFG_Type structure
  *                         that contains the configuration information for specified UART in RS485 mode.
  * @return  None
  */
void UART_SetConfigRS485(LPC_UART_TypeDef *UARTx, UART_RS485_CFG_Type *config)
{
    uint32_t tmp;

    CHECK_PARAM(PARAM_UART_485(UARTx));
    CHECK_PARAM(PARAM_UART_RS485_NORMAL_MULTIDROP(config->nmmen));
    CHECK_PARAM(PARAM_UART_RS485_RECEIVER(config->rxdis));
    CHECK_PARAM(PARAM_UART_RS485_AUTO_ADDRRESS(config->adden));
    CHECK_PARAM(PARAM_UART_RS485_DIRPIN_SELECT(config->dirpinsel));
    CHECK_PARAM(PARAM_UART_RS485_AUTO_DIRECTION(config->autodiren));
    CHECK_PARAM(PARAM_UART_RS485_DIRPIN_LEVEL(config->pinlevel));
    CHECK_PARAM((config->delay) < 0xFF);
    CHECK_PARAM((config->addrress) < 0xFF);

    // If Auto Direction Control is enabled -  This function is used in Master mode
    tmp = config->nmmen;
    tmp |= config->rxdis;
    tmp |= config->adden;
    tmp |= config->dirpinsel;
    tmp |= config->autodiren;
    tmp |= config->pinlevel;

    UARTx->RS485CTRL = tmp & UART_RS485CTRL_BITMASK;    
    UARTx->ADRMATCH = config->addrress & UART_RS485ADRMATCH_BITMASK;   
    UARTx->RS485DLY = config->delay & UART_RS485DLY_BITMASK;  

    UART_RS485Configration.nmmen = (*config).nmmen;
    UART_RS485Configration.rxdis = (*config).rxdis;
    UART_RS485Configration.adden = (*config).adden;
    UART_RS485Configration.dirpinsel = (*config).dirpinsel;
    UART_RS485Configration.autodiren = (*config).autodiren;
    UART_RS485Configration.pinlevel = (*config).pinlevel;
    UART_RS485Configration.delay = (*config).delay;
    UART_RS485Configration.addrress = (*config).addrress;

}


/**
  * @brief    Get configuration UART in RS485 mode according to the specified parameters
  * @param UARTx  Only should be LPC_UART0.
  * @param config   A pointer to UART_RS485_CFG_Type structure that
  *                         that contains the configuration information for specified UART in RS485 mode.
  * @return  None
  */
void UART_GetConfigRS485(LPC_UART_TypeDef *UARTx, UART_RS485_CFG_Type *config)
{
    CHECK_PARAM(PARAM_UART_485(UARTx));
    *config = UART_RS485Configration;
}
#endif /* _RS485 */

#ifdef _IRDA
/*
  * @brief   Configure UART in IRDA mode according to the specified parameters
  * @param UARTx  Only should be LPC_UART1
  * @param config   RS485ConfigStruct Pointer to a UART_IRDA_CFG_Type structure
  *                         that contains the configuration information for specified UART in IRDA mode.
  * @return  None
  */
void UART_SetConfigIRDA(LPC_UART_TypeDef *UARTx, UART_IRDA_CFG_Type *config)
{
    volatile uint32_t tmp;

    CHECK_PARAM(PARAM_UART_IRDA(UARTx));
    CHECK_PARAM(PARAM_UART_IRDA_MODE(config->mode));
    CHECK_PARAM(PARAM_UART_IRDA_INPUT(config->invert));
    CHECK_PARAM(PARAM_UART_IRDA_PULSEDIV(config->pulse));

    tmp = config->mode;
    tmp |= config->invert;
    tmp |= config->pulse;
    UARTx->ICR = tmp & UART_ICR_BITMASK;

    UART_IRDAConfigration.mode = (*config).mode;
    UART_IRDAConfigration.invert = (*config).invert;
    UART_IRDAConfigration.pulse = (*config).pulse;

}

/**
  * @brief    Get configuration UART in IRDA mode according to the specified parameters
  * @param UARTx  Only should be LPC_UART1.
  * @param config   A pointer to UART_IRDA_CFG_Type structure that
  *                         that contains the configuration information for specified UART in IRDA mode.
  * @return  None
  */
void UART_GetConfigIRDA(LPC_UART_TypeDef *UARTx, UART_IRDA_CFG_Type *config)
{
    CHECK_PARAM(PARAM_UART_IRDA(UARTx));
    *config = UART_IRDAConfigration;
}
#endif /* _IRDA */

/**
 * @}
 */

#endif /* _UART */

/**
 * @}
 */

/* --------------------------------- End Of File ------------------------------ */

